# StairsRuntypeTotalDepth Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsRuntypeTotalDepth Property
ParameterTypeId Class See Also
---
"Total Depth": Total Depth
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsRuntypeTotalDepth { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsRuntypeTotalDepth As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsRuntypeTotalDepth {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace